Revit 2027 API
ParameterTypeId.StructuralBeamCutbackForColumn Property
 "Beam cutback in plan"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamCutbackForColumn { get; }
Public Shared ReadOnly Property StructuralBeamCutbackForColumn As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamCutbackForColumn {
	ForgeTypeId^ get ();
}
static member StructuralBeamCutbackForColumn : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace